In [30]:
# chapter 1

In [2]:
import pandas as pd
import numpy as np

In [4]:
df1=pd.DataFrame({'key':list('bkadkdj'),
                 'data1':range(7)})

df2=pd.DataFrame({'key':list('skq'),
                 'data2':range(3)})

In [5]:
df1

   data1 key
0      0   b
1      1   k
2      2   a
3      3   d
4      4   k
5      5   d
6      6   j

In [6]:
df2

   data2 key
0      0   s
1      1   k
2      2   q

In [7]:
# inner join
pd.merge(df1,df2,on='key')

   data1 key  data2
0      1   k      1
1      4   k      1

In [8]:
# full join
pd.merge(df1,df2,on='key',how='outer')

   data1 key  data2
0    0.0   b    NaN
1    1.0   k    1.0
2    4.0   k    1.0
3    2.0   a    NaN
4    3.0   d    NaN
5    5.0   d    NaN
6    6.0   j    NaN
7    NaN   s    0.0
8    NaN   q    2.0

In [11]:
# left join // right join
pd.merge(df1,df2,on='key',how='left')

   data1 key  data2
0      0   b    NaN
1      1   k    1.0
2      2   a    NaN
3      3   d    NaN
4      4   k    1.0
5      5   d    NaN
6      6   j    NaN

In [12]:
df3=pd.DataFrame({'key1':list('bkadkdj'),
                 'data1':range(7)})

df4=pd.DataFrame({'key2':list('skq'),
                 'data2':range(3)})

In [13]:
# 키 값이 다를때
pd.merge(df3,df4,left_on='key1',right_on='key2')
# 인덱스로 할때는 right_index=True / left_index=True

   data1 key1  data2 key2
0      1    k      1    k
1      4    k      1    k

In [15]:
#concaternator
s1=pd.Series([0,1],index=['a','b'])
s2=pd.Series([2,5,1],index=['c','d','e'])
s3=pd.Series([5,6],index=['f','g'])

In [19]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  5.0  NaN
e  NaN  1.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [20]:
s4=pd.concat([s1*5,s3])

In [27]:
pd.concat([s1,s4],axis=1,keys=['first','second'])

   first  second
a    0.0       0
b    1.0       5
f    NaN       5
g    NaN       6

In [31]:
# chapter 2

In [40]:
s=pd.Series(np.random.randn(10),
           index=[list('abaabbcjcj'),
                  np.arange(10)])

In [41]:
s

a  0    0.595840
b  1    1.728174
a  2    0.214388
   3   -0.851194
b  4   -0.043726
   5   -0.620884
c  6    0.353320
j  7    0.757188
c  8   -1.266469
j  9    0.803185
dtype: float64

In [42]:
s.index

MultiIndex(levels=[['a', 'b', 'c', 'j'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]],
           labels=[[0, 1, 0, 0, 1, 1, 2, 3, 2, 3], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]])

In [1]:
# chapter 3

In [3]:
df=pd.DataFrame({'k1':['one']*3+['two']*4,
                'k2':[1,1,2,3,3,4,4]})

In [4]:
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [5]:
df.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [6]:
df.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [7]:
df['v1']=np.arange(7)

In [8]:
df

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [15]:
df.drop_duplicates(['k1','k2'],keep='last') #default first

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [16]:
df2=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
                 'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [17]:
df2

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [18]:
meat_to_animal={'bacon':'pig',
               'pulled pork':'pig',
               'pastrami':'cow',
               'corned beef':'cow',
               'honey ham':'pig',
               'nova lox':'salmon'}

In [21]:
df2['animal']=df2['food'].apply(lambda x:meat_to_animal[x.lower()])

In [22]:
df2

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [23]:
s=pd.Series([1.,-999,2.,-999.,-1000.,3.])

In [24]:
s

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [30]:
s.replace(-999,np.nan).fillna(100)

0       1.0
1     100.0
2       2.0
3     100.0
4   -1000.0
5       3.0
dtype: float64

In [62]:
#Categories type
df3=pd.DataFrame({'id':np.arange(1,7),'raw_grade':list('abbaae')})

In [63]:
df3

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [64]:
df3['grade']=df3['raw_grade'].astype('category')

In [66]:
df3['grade'].cat.categories

Index(['a', 'b', 'e'], dtype='object')

In [70]:
df3['grade'].cat.categories=['very good','good','very bad']

In [73]:
df3['grade']=df3['grade'].cat.set_categories(['very good','good','bad','very bad'])

In [74]:
df3['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (4, object): [very good, good, bad, very bad]

In [79]:
df3.sort_values(by='grade',ascending=False)

   id raw_grade      grade
5   6         e   very bad
2   3         b       good
1   2         b       good
4   5         a  very good
3   4         a  very good
0   1         a  very good

In [82]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
bins=[18,25,35,60,100]

In [84]:
cats=pd.cut(ages,bins)

In [85]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [86]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [89]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [90]:
group_names=['youth','young','middle','senior']

In [91]:
pd.cut(ages,bins,labels=group_names)

[youth, youth, youth, young, youth, ..., young, senior, middle, middle, young]
Length: 12
Categories (4, object): [youth < young < middle < senior]

In [105]:
cats.categories=group_names

In [106]:
cats

[youth, youth, youth, young, youth, ..., young, senior, middle, middle, young]
Length: 12
Categories (4, object): [youth < young < middle < senior]

In [107]:
# 갯수로 나누기

In [108]:
data=np.random.randn(20)

In [109]:
data

array([-0.37480368,  1.2085764 ,  0.27731752,  0.72545834,  0.33077682,
       -0.65377232,  0.2885788 , -0.27851536,  0.02436976, -1.31989304,
       -0.30615759, -0.47785051, -1.50816678,  1.64569377, -1.05098757,
        0.16988794, -0.46055504, -0.74072963, -0.21895634,  0.93978887])

In [110]:
pd.cut(data,4,precision=2)

[(-0.72, 0.069], (0.86, 1.65], (0.069, 0.86], (0.069, 0.86], (0.069, 0.86], ..., (0.069, 0.86], (-0.72, 0.069], (-1.51, -0.72], (-0.72, 0.069], (0.86, 1.65]]
Length: 20
Categories (4, interval[float64]): [(-1.51, -0.72] < (-0.72, 0.069] < (0.069, 0.86] < (0.86, 1.65]]

In [113]:
# pd.qcut(data,x)  -> x분위수로 나눔

[(-1.509, -0.249], (-0.249, 1.646], (-0.249, 1.646], (-0.249, 1.646], (-0.249, 1.646], ..., (-0.249, 1.646], (-1.509, -0.249], (-1.509, -0.249], (-0.249, 1.646], (-0.249, 1.646]]
Length: 20
Categories (2, interval[float64]): [(-1.509, -0.249] < (-0.249, 1.646]]

In [114]:
# chapter 4

In [115]:
df=pd.DataFrame({'key1':list('aabba'),
                 'key2':['one','two','one','two','one'],
                 'data1':np.random.randn(5),
                 'data2':np.random.randn(5)
    
    
})

In [116]:
df

      data1     data2 key1 key2
0  0.954701  1.233732    a  one
1  1.665517 -0.372540    a  two
2 -0.508377 -0.833705    b  one
3 -0.030678  0.029827    b  two
4  0.460720  0.857768    a  one

In [143]:
# groupby -> split - apply - combine
grouped=df['data1'].groupby([df['key1'],df['key2']])

In [141]:
grouped.mean()
grouped.sum()

key1  key2
a     one     1.415421
      two     1.665517
b     one    -0.508377
      two    -0.030678
Name: data1, dtype: float64

In [148]:
for name,group in df.groupby(['key1','key2']):
    print(name)
    print(group)

('a', 'one')
      data1     data2 key1 key2
0  0.954701  1.233732    a  one
4  0.460720  0.857768    a  one
('a', 'two')
      data1    data2 key1 key2
1  1.665517 -0.37254    a  two
('b', 'one')
      data1     data2 key1 key2
2 -0.508377 -0.833705    b  one
('b', 'two')
      data1     data2 key1 key2
3 -0.030678  0.029827    b  two

In [151]:
dict(list(df.groupby('key1')))

{'a':       data1     data2 key1 key2
 0  0.954701  1.233732    a  one
 1  1.665517 -0.372540    a  two
 4  0.460720  0.857768    a  one, 'b':       data1     data2 key1 key2
 2 -0.508377 -0.833705    b  one
 3 -0.030678  0.029827    b  two}

In [167]:
groupped=df.groupby('key1')

In [168]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [170]:
groupped.agg(peak_to_peak)

         data1     data2
key1
a     1.204797  1.606272
b     0.477699  0.863532

In [171]:
groupped.agg('std')

         data1     data2
key1
a     0.605642  0.840150
b     0.337784  0.610609

In [172]:
groupped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  1.026979  0.605642  0.460720  0.707710  0.954701  1.310109
b      2.0 -0.269527  0.337784 -0.508377 -0.388952 -0.269527 -0.150103

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.665517   3.0  0.572987  0.840150 -0.372540  0.242614  0.857768
b    -0.030678   2.0 -0.401939  0.610609 -0.833705 -0.617822 -0.401939


           75%       max
key1
a     1.045750  1.233732
b    -0.186056  0.029827